import "./App.css";
import City from "./City";

function App() {
    const cities = [
        {
            name: "Київ",
            population: "2,884 мільйона",
            description:
                "Ки́їв — столиця та найбільше місто України, одне з найбільших і найстаріших міст Європи. Розташований у середній течії Дніпра, у північній Наддніпрянщині. Політичний, соціально-економічний, транспортний, освітньо-науковий, історичний, культурний та духовний центр України.",
        },
        {
            name: "Львів",
            population: "721 тисяч",
            description:
                "Львів — місто в Україні, адміністративний центр області, агломерації, району, міської громади, національно-культурний та освітньо-науковий осередок країни, великий промисловий центр і транспортний вузол, вважається столицею Галичини та центром Західної України. За кількістю населення — сьоме місто країни.",
        },
        {
            name: "Одеса",
            population: "993 тисяч",
            description:
                "Оде́са — місто в Україні, Одеська область, Одеський район. Адміністративний центр області та району. Третє найбільше місто країни після Києва та Харкова. Розташоване на узбережжі Чорного моря. Найбільший морський торговий порт держави. Культурно-освітній, туристичний, торговий, транспортний центр.",
        },
        {
            name: "Харків",
            population: "1,419 мільйона",
            description:
                "Ха́рків — місто України. Розташоване на північному сході України на Слобожанщині, науковий центр України, адміністративний центр Харківської області. Друге за кількістю мешканців місто України з населенням 1 421 125 осіб.",
        },
        {
            name: "Дніпро",
            population: "966 тисяч",
            description:
                "Дніпро́ — місто в Україні на обох берегах р. Дніпро, адміністративний центр Дніпропетровської області, Дніпровського району та Дніпровської міської громади. Місто є четвертим за чисельністю населення в Україні після Києва, Харкова та Одеси. Дніпро вважається «космічною столицею» України.",
        },
        {
            name: "Запоріжжя",
            population: "746 тисяч",
            description:
                "Запорі́жжя — місто в Україні, адміністративний центр Запорізької області. За кількістю населення — шосте місто країни.",
        },
        {
            name: "Вінниця",
            population: "370 тисяч",
            description:
                "Ві́нниця — місто на берегах Південного Бугу, адміністративний центр Вінницької області, Вінницького району, значний історичний осередок східного Поділля, центр Вінницької агломерації.",
        },
        {
            name: "Івано-Франківськ",
            population: "230 тисяч",
            description:
                "Іва́но-Франкі́вськ — місто в Україні, обласний центр Івано-Франківської області, економічний і культурний центр Прикарпаття. Один із трьох головних центрів історико-географічного регіону Галичина. Назване 1962 року на честь Івана Франка.",
        },
    ];
    return (
        <div className="App">
            {cities.map((info) => (
                <City
                    name={info.name}
                    population={info.population}
                    description={info.description}
                />
            ))}
        </div>
    );
}

export default App;
